In [6]:
import mysql.connector as con

In [7]:
mydb=con.connect(host='localhost', user='root', password='r@shika123')

In [8]:
mydb

In [9]:
cursor=mydb.cursor()# its a pointer.

# Q-1) Write an SQL query to print the First_Name from worker table after replacing "a" with 'A'

In [10]:
cursor.execute("use organisation")

In [11]:
import pandas as pd

In [12]:
pd.read_sql('select * from organisation.worker_table',mydb)

    Department_ID Department          First_Name     Salary
0               1        DSL       Rajdeep Singh  200000000
1               2        DSL           Raj Singh  100000000
2               3        DSL          Deep Singh  300000000
3               4    Content           Rishabh D    2000000
4               5    Content            Ritesh D    3000000
5               6    Content                Renu     400000
6               7         HR      Sonakshi Singh    5000000
7               8    Product              Salini    6000000
8               9  Developer             Natasha    8000000
9              10  Developer            Minakshi    9000000
10             11  Developer             Amitabh    9500000
11             12        DSL       Rajdeep S         200000
12             13        DSL    Sakshi Singh         800000
13             14    Content  Ranjana Shetty         900000
14             15  Developer         Sejal H         950000

In [13]:
d=pd.read_sql('select * from organisation.worker_table',mydb)

In [14]:
d.rename({'Department_ID':'ID'}, axis=1, inplace=True)

In [15]:
d

    ID Department          First_Name     Salary
0    1        DSL       Rajdeep Singh  200000000
1    2        DSL           Raj Singh  100000000
2    3        DSL          Deep Singh  300000000
3    4    Content           Rishabh D    2000000
4    5    Content            Ritesh D    3000000
5    6    Content                Renu     400000
6    7         HR      Sonakshi Singh    5000000
7    8    Product              Salini    6000000
8    9  Developer             Natasha    8000000
9   10  Developer            Minakshi    9000000
10  11  Developer             Amitabh    9500000
11  12        DSL       Rajdeep S         200000
12  13        DSL    Sakshi Singh         800000
13  14    Content  Ranjana Shetty         900000
14  15  Developer         Sejal H         950000

In [16]:
cursor.execute("select replace(First_Name,'a','A') from worker_table")
cursor.fetchall()

[('RAjdeep Singh',),
 ('RAj Singh',),
 ('Deep Singh',),
 ('RishAbh D',),
 ('Ritesh D',),
 ('Renu',),
 ('SonAkshi Singh',),
 ('SAlini',),
 ('NAtAshA',),
 ('MinAkshi',),
 ('AmitAbh',),
 ('RAjdeep S    ',),
 ('SAkshi Singh    ',),
 ('RAnjAnA Shetty    ',),
 ('SejAl H    ',)]

# Q-2) Write an SQL query to print all worker details from the worker table order by First_Name Ascending and Department Descending.

In [17]:
cursor.execute("select * from worker_table order by First_Name Asc, Department Desc")
cursor.fetchall()

[(11, 'Developer', 'Amitabh', 9500000),
 (3, 'DSL', 'Deep Singh', 300000000),
 (10, 'Developer', 'Minakshi', 9000000),
 (9, 'Developer', 'Natasha', 8000000),
 (2, 'DSL', 'Raj Singh', 100000000),
 (12, 'DSL', 'Rajdeep S    ', 200000),
 (1, 'DSL', 'Rajdeep Singh', 200000000),
 (14, 'Content', 'Ranjana Shetty    ', 900000),
 (6, 'Content', 'Renu', 400000),
 (4, 'Content', 'Rishabh D', 2000000),
 (5, 'Content', 'Ritesh D', 3000000),
 (13, 'DSL', 'Sakshi Singh    ', 800000),
 (8, 'Product', 'Salini', 6000000),
 (15, 'Developer', 'Sejal H    ', 950000),
 (7, 'HR', 'Sonakshi Singh', 5000000)]

# Q-3) Write an SQL query to fetch the name of worker who earns the highest salary.

In [18]:
cursor.execute("select First_Name, salary from worker_table where salary=(select max(salary) from worker_table)")
cursor.fetchall()

[('Deep Singh', 300000000)]

                                    Keep Learning, Keep Growing...